# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет,
# является ли этот день выходным.
# Пример:
# - 6 -> да # - 7 -> да # - 1 -> нет

a = int(input('Введите число от 1 до 7: '))
if a == 1:
    print('no')
elif a == 2:
    print('no')
elif a == 3:
    print('no')
elif a == 4:
    print('no')
elif a == 5:
    print('no')
elif a == 6:
    print('yes')
elif a == 7:
    print('yes')