# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет,
# является ли этот день выходным.
# Пример:
# - 6 -> да # - 7 -> да # - 1 -> нет

number = int(input('Введите число от 1 до 7: '))

if(1 or 2 or 3 or 4 or 5):
    print('NO')
elif(6 or 7):
    print('YES')
